---
kind: type
id: T:Autodesk.Revit.DB.LineAndTextAttrSymbol
source: html/1a0a0d23-891b-bf92-6b2b-069704dea9be.htm
---
# Autodesk.Revit.DB.LineAndTextAttrSymbol

An object that represents a dimension style.

## Syntax (C#)
```csharp
public class LineAndTextAttrSymbol : ElementType
```